In [5]:
from utils import Extractor
import pandas as pd

## EXTRAÇÃO

In [21]:
# extract
extractor = Extractor()
products = extractor.get_products()
users = extractor.get_users()
vendas_df = pd.read_csv("data/vendas.csv", sep=",", encoding="utf-8")

2024-12-02 16:21:18.455 | INFO     | utils:_fetch_data:20 - Carregando dados de products...
2024-12-02 16:21:18.770 | INFO     | utils:_fetch_data:32 - Dados de products carregados com sucesso!
2024-12-02 16:21:18.771 | INFO     | utils:_fetch_data:20 - Carregando dados de users...
2024-12-02 16:21:19.189 | INFO     | utils:_fetch_data:32 - Dados de users carregados com sucesso!

In [34]:
# analise products
products_df = pd.DataFrame(products)
products_df.head()

,id,title,price,description,category,image,rating
0,1,"Fjallraven - Foldsack No. 1 Backpack, Fits 15 ...",109.95,Your perfect pack for everyday use and walks i...,men's clothing,https://fakestoreapi.com/img/81fPKd-2AYL._AC_S...,"{'rate': 3.9, 'count': 120}"
1,2,Mens Casual Premium Slim Fit T-Shirts,22.30,"Slim-fitting style, contrast raglan long sleev...",men's clothing,https://fakestoreapi.com/img/71-3HjGNDUL._AC_S...,"{'rate': 4.1, 'count': 259}"
2,3,Mens Cotton Jacket,55.99,great outerwear jackets for Spring/Autumn/Wint...,men's clothing,https://fakestoreapi.com/img/71li-ujtlUL._AC_U...,"{'rate': 4.7, 'count': 500}"
3,4,Mens Casual Slim Fit,15.99,The color could be slightly different between ...,men's clothing,https://fakestoreapi.com/img/71YXzeOuslL._AC_U...,"{'rate': 2.1, 'count': 430}"
4,5,John Hardy Women's Legends Naga Gold & Silver ...,695.00,"From our Legends Collection, the Naga was insp...",jewelery,https://fakestoreapi.com/img/71pWzhdJNwL._AC_U...,"{'rate': 4.6, 'count': 400}"

In [11]:
products_df.columns

Index(['id', 'title', 'price', 'description', 'category', 'image', 'rating'], dtype='object')

In [12]:
products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   title        20 non-null     object
 2   price        20 non-null     float64
 3   description  20 non-null     object
 4   category     20 non-null     object
 5   image        20 non-null     object
 6   rating       20 non-null     object
dtypes: float64(1), int64(1), object(5)
memory usage: 1.2+ KB

In [13]:
products_df.isna().sum()

id             0
title          0
price          0
description    0
category       0
image          0
rating         0
dtype: int64

In [9]:
products_df.shape

(20, 7)

In [8]:
products_df["id"].unique().shape

(20,)

In [10]:
products_df['id'].duplicated().sum()

0

In [14]:
# analise users
users_df = pd.DataFrame(users)
users_df.head()

,address,id,email,username,password,name,phone,__v
0,"{'geolocation': {'lat': '-37.3159', 'long': '8...",1,john@gmail.com,johnd,m38rmF$,"{'firstname': 'john', 'lastname': 'doe'}",1-570-236-7033,0
1,"{'geolocation': {'lat': '-37.3159', 'long': '8...",2,morrison@gmail.com,mor_2314,83r5^_,"{'firstname': 'david', 'lastname': 'morrison'}",1-570-236-7033,0
2,"{'geolocation': {'lat': '40.3467', 'long': '-3...",3,kevin@gmail.com,kevinryan,kev02937@,"{'firstname': 'kevin', 'lastname': 'ryan'}",1-567-094-1345,0
3,"{'geolocation': {'lat': '50.3467', 'long': '-2...",4,don@gmail.com,donero,ewedon,"{'firstname': 'don', 'lastname': 'romer'}",1-765-789-6734,0
4,"{'geolocation': {'lat': '40.3467', 'long': '-4...",5,derek@gmail.com,derek,jklg*_56,"{'firstname': 'derek', 'lastname': 'powell'}",1-956-001-1945,0

In [15]:
users_df.columns

Index(['address', 'id', 'email', 'username', 'password', 'name', 'phone',
       '__v'],
      dtype='object')

In [16]:
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   address   10 non-null     object
 1   id        10 non-null     int64
 2   email     10 non-null     object
 3   username  10 non-null     object
 4   password  10 non-null     object
 5   name      10 non-null     object
 6   phone     10 non-null     object
 7   __v       10 non-null     int64
dtypes: int64(2), object(6)
memory usage: 772.0+ bytes

In [17]:
users_df.isna().sum()

address     0
id          0
email       0
username    0
password    0
name        0
phone       0
__v         0
dtype: int64

In [18]:
users_df.shape

(10, 8)

In [19]:
users_df['id'].duplicated().sum()

0

In [20]:
users_df['id'].unique().shape

(10,)

In [22]:
# analise vendas
vendas_df.head()

   product_id  user_id        date payment_method  quantity    total
0           2        1  2004-04-18            Pix         2    44.60
1          13        4  2004-01-23           Cash         7  4193.00
2           4       10  2003-08-19           Cash         1    15.99
3          10        7  2004-03-08           Cash         8   872.00
4           1        5  2003-03-20            Pix         7   769.65

In [23]:
vendas_df.columns

Index(['product_id', 'user_id', 'date', 'payment_method', 'quantity', 'total'], dtype='object')

In [24]:
vendas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   product_id      1000 non-null   int64
 1   user_id         1000 non-null   int64
 2   date            1000 non-null   object
 3   payment_method  1000 non-null   object
 4   quantity        1000 non-null   int64
 5   total           1000 non-null   float64
dtypes: float64(1), int64(3), object(2)
memory usage: 47.0+ KB

In [25]:
vendas_df.isna().sum()

product_id        0
user_id           0
date              0
payment_method    0
quantity          0
total             0
dtype: int64

In [26]:
vendas_df.shape

(1000, 6)

## TRANSFORMAÇÃO

In [35]:
# products
products_df['rate'] = products_df['rating'].apply(lambda x: x['rate'])
products_df['rating_count'] = products_df['rating'].apply(lambda x: x['count'])
products_df.drop('rating', axis=1, inplace=True)

products_df.head()

,id,title,price,description,category,image,rate,rating_count
0,1,"Fjallraven - Foldsack No. 1 Backpack, Fits 15 ...",109.95,Your perfect pack for everyday use and walks i...,men's clothing,https://fakestoreapi.com/img/81fPKd-2AYL._AC_S...,3.9,120
1,2,Mens Casual Premium Slim Fit T-Shirts,22.30,"Slim-fitting style, contrast raglan long sleev...",men's clothing,https://fakestoreapi.com/img/71-3HjGNDUL._AC_S...,4.1,259
2,3,Mens Cotton Jacket,55.99,great outerwear jackets for Spring/Autumn/Wint...,men's clothing,https://fakestoreapi.com/img/71li-ujtlUL._AC_U...,4.7,500
3,4,Mens Casual Slim Fit,15.99,The color could be slightly different between ...,men's clothing,https://fakestoreapi.com/img/71YXzeOuslL._AC_U...,2.1,430
4,5,John Hardy Women's Legends Naga Gold & Silver ...,695.00,"From our Legends Collection, the Naga was insp...",jewelery,https://fakestoreapi.com/img/71pWzhdJNwL._AC_U...,4.6,400

In [36]:
# users
users_df.head(3)

,address,id,email,username,password,name,phone,__v
0,"{'geolocation': {'lat': '-37.3159', 'long': '8...",1,john@gmail.com,johnd,m38rmF$,"{'firstname': 'john', 'lastname': 'doe'}",1-570-236-7033,0
1,"{'geolocation': {'lat': '-37.3159', 'long': '8...",2,morrison@gmail.com,mor_2314,83r5^_,"{'firstname': 'david', 'lastname': 'morrison'}",1-570-236-7033,0
2,"{'geolocation': {'lat': '40.3467', 'long': '-3...",3,kevin@gmail.com,kevinryan,kev02937@,"{'firstname': 'kevin', 'lastname': 'ryan'}",1-567-094-1345,0

In [38]:
users_df['full_name'] = users_df['name'].apply(lambda x: f"{x['firstname']} {x['lastname']}")
users_df['full_address'] = users_df['address'].apply(lambda x: f"{x['number']} {x['street']}, {x['city']}, {x['zipcode']}")
users_df['lat'] = users_df['address'].apply(lambda x: x['geolocation']['lat'])
users_df['long'] = users_df['address'].apply(lambda x: x['geolocation']['long'])
users_df.drop(columns=['name', 'address', 'password', '__v'], axis=1, inplace=True)
users_df.head(3)

,id,email,username,phone,full_name,full_address,lat,long
0,1,john@gmail.com,johnd,1-570-236-7033,john doe,"7682 new road, kilcoole, 12926-3874",-37.3159,81.1496
1,2,morrison@gmail.com,mor_2314,1-570-236-7033,david morrison,"7267 Lovers Ln, kilcoole, 12926-3874",-37.3159,81.1496
2,3,kevin@gmail.com,kevinryan,1-567-094-1345,kevin ryan,"86 Frances Ct, Cullman, 29567-1452",40.3467,-30.1310

## LOAD

In [ ]:
import os
import sqlite3 

DB_PATH = 'data/teste.db'
os.path.isfile('data/vendas.csv')

True

In [ ]:
# criando tabela produtos
conn = sqlite3.connect(DB_PATH)

cursor = conn.cursor()
cursor.execute('''
    CREATE TABLE IF NOT EXISTS products (
        id INTEGER PRIMARY KEY,
        title TEXT,
        price REAL,
        description TEXT,
        category TEXT,
        image TEXT,
        rate REAL,
        rating_count INTEGER
    )
''')
conn.commit()
conn.close()

In [45]:
# criando tabela users
conn = sqlite3.connect(DB_PATH)

cursor = conn.cursor()
cursor.execute('''
    CREATE TABLE IF NOT EXISTS users (
        id INTEGER PRIMARY KEY,
        email TEXT,
        username TEXT,
        phone TEXT,
        full_name TEXT,
        full_address TEXT,
        lat REAL,
        long REAL
    )
''')
conn.commit()
conn.close()

In [46]:
# criando tabela vendas
conn = sqlite3.connect(DB_PATH)

cursor = conn.cursor()
cursor.execute('''
    CREATE TABLE IF NOT EXISTS sales (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        product_id INTEGER,
        user_id INTEGER,
        date TEXT,
        payment_method TEXT,
        quantity INTEGER,
        total REAL,
        FOREIGN KEY (product_id) REFERENCES products (id),
        FOREIGN KEY (user_id) REFERENCES users (id)
    )
''')
conn.commit()
conn.close()

In [47]:
# populando db
conn = sqlite3.connect(DB_PATH)
products_df.to_sql('products', conn, if_exists='append', index=False)
users_df.to_sql('users', conn, if_exists='append', index=False)
vendas_df.to_sql('sales', conn, if_exists='append', index=False)
conn.close()

In [50]:
conn = sqlite3.connect(DB_PATH)
pd.read_sql_query("SELECT * FROM products LIMIT 5", conn)

,id,title,price,description,category,image,rate,rating_count
0,1,"Fjallraven - Foldsack No. 1 Backpack, Fits 15 ...",109.95,Your perfect pack for everyday use and walks i...,men's clothing,https://fakestoreapi.com/img/81fPKd-2AYL._AC_S...,3.9,120
1,2,Mens Casual Premium Slim Fit T-Shirts,22.30,"Slim-fitting style, contrast raglan long sleev...",men's clothing,https://fakestoreapi.com/img/71-3HjGNDUL._AC_S...,4.1,259
2,3,Mens Cotton Jacket,55.99,great outerwear jackets for Spring/Autumn/Wint...,men's clothing,https://fakestoreapi.com/img/71li-ujtlUL._AC_U...,4.7,500
3,4,Mens Casual Slim Fit,15.99,The color could be slightly different between ...,men's clothing,https://fakestoreapi.com/img/71YXzeOuslL._AC_U...,2.1,430
4,5,John Hardy Women's Legends Naga Gold & Silver ...,695.00,"From our Legends Collection, the Naga was insp...",jewelery,https://fakestoreapi.com/img/71pWzhdJNwL._AC_U...,4.6,400

In [51]:
pd.read_sql_query("SELECT * FROM users LIMIT 5", conn)

,id,email,username,phone,full_name,full_address,lat,long
0,1,john@gmail.com,johnd,1-570-236-7033,john doe,"7682 new road, kilcoole, 12926-3874",-37.3159,81.1496
1,2,morrison@gmail.com,mor_2314,1-570-236-7033,david morrison,"7267 Lovers Ln, kilcoole, 12926-3874",-37.3159,81.1496
2,3,kevin@gmail.com,kevinryan,1-567-094-1345,kevin ryan,"86 Frances Ct, Cullman, 29567-1452",40.3467,-30.1310
3,4,don@gmail.com,donero,1-765-789-6734,don romer,"6454 Hunters Creek Dr, San Antonio, 98234-1734",50.3467,-20.1310
4,5,derek@gmail.com,derek,1-956-001-1945,derek powell,"245 adams St, san Antonio, 80796-1234",40.3467,-40.1310

In [52]:
pd.read_sql_query("SELECT * FROM sales LIMIT 5", conn)

   id  product_id  user_id        date payment_method  quantity    total
0   1           2        1  2004-04-18            Pix         2    44.60
1   2          13        4  2004-01-23           Cash         7  4193.00
2   3           4       10  2003-08-19           Cash         1    15.99
3   4          10        7  2004-03-08           Cash         8   872.00
4   5           1        5  2003-03-20            Pix         7   769.65

In [53]:
conn.close()